test/artillery.yaml
config:
  target: "http://testkube-triggers-example-service:8080"
  phases:
    - duration: 6
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 15
      arrivalRate: 20
      name: Sustained load
scenarios:
  - name: "Check health endpoint"
    flow:
      - get:
          url: "/health"